# Задача №1:
#
# a)
#     Напишете програма, която при подадено цяло число n, принтира всяко число i между 1 и n. <br>
# б)
# Същото, но принтирайки само четните числа между 1 и n. <br>
# в)
# Принтирайте числата между n и n^2, които се делят на 3. <br>
# г)
# Принтирайте сбора на числата между 1 и n^2. <br>
# д)
# Принтирайте n! при подадено число n

n = 5
for i in range(1, n + 1):
    print(i)

for i in range(1, n + 1):
    if i % 2 == 0:
        print(i)

for i in range(1, n ** 2 + 1):
    if i % 3 == 0:
        print(i)

sum = 0
for i in range(1, n ** 2 + 1):
    sum += i

print(sum)

mult = 1
for i in range(1, n + 1):
    mult *= i

print(mult)
