# Задача №2:
#
# Напишете цикъл, който принтира числата от 0 до 1000, които се делят на 13.<br>
# След това напишете същият този цикъл използвайки стъпка, вместо if в тялото на цикъла.

for i in range(0, 1001):
    if i % 13 == 0:
        print(i)

for i in range(0, 1001, 13):
    print(i)
