# Задача №3

# Напишете програма, която принтира дължината на string въведен от потребителя, без да използвате len().<br>
# (Hint: използвайте цикъл, който итерира по символите на string-а)

len_str = 0
a_str = 'hello'

for i in a_str:
    len_str += 1

print(len_str)
