# Задача №3
# При подадени 5 цели числа от потребителя, намерете максимума и минимума, които могат да бъдат
# получени чрез сума на ТОЧНО 4 числа от 5те. След това принтирайте двете числа с " " между тях.
# (Hint: За целта използвайте list, и приложете функция над него :-) )

list1 = []

for i in range(5):
    number = int(input(f"{i+1} number: "))
    list1.append(number)

list1.sort()
print(f"{list1[1]} {list1[-1]}")

