# Задача №5
# Напишете програма, която приема стойности от 1 до 10 като ключове в речник, чийто стойности са техните квадрати.
# (Визуализирайте получения речник в конзолата.)

dict1 = {}

for i in range(1,11):
    dict1[i] = i**2

print(dict1)