# Задача №6
# Напишете програма, която:
#
# a) приема число N от потребителя

# б) приема N двойки (ключ-стойност) от потребителя, които се запазват в речник, като всеки път се проверява
# дали вече има такъв ключ в речника, и ако има такъв се принтира "key already exists" и се продължава
# нататък с въвеждането (без да се презаписва стойността!)

# в) речникът се принтира на екрана
#

n = int(input())
dict1 = {}

for i in range(n):
    key = input(f"key {i+1}: ")
    value = input(f"value {i+1}: ")
    if key in dict1.keys():
        print("key already exists")
    else:
        dict1[key] = value

print(dict1)
