# Задача №7
# Напишете програма, която приема вход два речника с дължини N и М от потребителя и създава нов
# речник, който обединява входните два, но събирайки стойностите, ако ключовете съвпадат.
#
# Приемаме, че стойностите винаги са от тип integer, но това не важи за ключовете!
#

N = {'hello': 100, 'b': 200, 'world': 300}
M = {'world': 300, 'b': 200, 'd': 400}
K = {}
for i in N.keys():
    K[i] = N[i] + M.get(i, 0)
for i in M.keys():
    if i not in K:
        K[i] = M[i] + N.get(i, 0)
print(K)
