# вариант №1:
num = 5
odd_or_even = num % 2  # 5 % 2 = 1, т.е. е нечетно и затова връща остатък 1
print((odd_or_even + 1) % 2)  # (1 + 1) % 2 = 2 % 2 = 0 (желания изход при стартиране на задачата (1 - четно; 0 - нечетно))

# вариант №2 (предложен от колега):
# по-бърз алгоритъм, в който е приложено математическото знание, че ако имаме четно число, то е заобиколено от нечетни числа и затова 
# може да се използва следната закономерност (num - 1) % 2, което ще ни връща желания резултат
# Примери:
# num = 4 -> (4-1)%2 = 1
# num = 7 -> (7-1)%2 = 0

num = 6
print((num - 1) % 2) # (6 - 1) % 2 = 5 % 2 = 1
