# идеята на задачата е посредством операциите, които притежават числата, и с помощта на задача №2 да се разгледа огледален 
# образ на подаденото от нас число
# ще разгледаме числото 297, като вземем цифрата, разположена съответно на позицията на единиците, десетиците и стотиците
num = 297

num_1 = num % 10 # 297 = 29 * 10 + 7 -> 297 % 10 = 7 
num_10 = int(num / 10) % 10 # int(29,7) = 29 = 2 * 10 + 9 -> 29 % 10 = 9
num_100 = int(num / 100) # int(2,97) = 2 (използвано в задача №2)

print(f"{num_1}{num_10}{num_100}")
