"""
Имате вход два символни низа. Можете да правите само две операции върху първият низ, а вторият не можете да го пипате. Операциите са следните:

добавяне на нов символ към края на сегашния низ
премахване на последния символ на сегащния низ (ако премахнете символ от празен низ пак получавате празен низ) При подадено число k и двата низа s и t, 
проверете дали можете да промените s да бъде същото като t, като извършвате по-малко или точно k операции. Ако можете, принтирайте Yes. Иначе принтирайте No.
Пример
Вход: s = [a, b, c], t = [d, e ,f], k = 6
За да променим s до t са ни нужни 6 операции:
премахваме 3-те елемента на s един по един (3 операции)
добавяме d, e, f към s (отново 3 операции) Изход: Yes
(Hint: функцията трябва да изглежда по следния начин:
string appendAndDelete(string s, string t, int k) { (тяло на функцията) }
"""


def appendAndDelete(s, t, k):
    countSteps = 0

    for item in s.copy():
        if item not in t:
            s.remove(item)
            countSteps += 1

    for item in t:
        if item not in s:
            s.append(item)
            countSteps += 1

    if countSteps <= k:
        return "Yes"

    return "No"


print(appendAndDelete(['a', 'b', 'c'], ['d', 'b', 'f'], 6))
