# Задача №1
# Проверете дали даден низ е палиндром без значение размера на буквите.

# За да не се отрази големината на буквите входните данни ги правим с малки букви
a_string = input("Enter a string:\t").lower()

# чрез булевия оператор == проверяваме дали даден елемент съвпада с друг по тип и стойност
print("Palindrome?", a_string == a_string[::-1])
