# Задача №3
# Обяд е и решавате да посетите KFC, за да си поръчате следните менюта:
#
# HOT Combo - 19,95 лв.
# Тауър меню - 13,80 лв.
# Меню 8 пикантни крилца - 13,50 лв.
# Направете програма, която изчислява сумата, която трябва да платите, при условие че оставяте бакшиш на служителя,
# като закръглите сумата до цяло число. Форматирайте по подходящ начин съобщението, което ще се появи в конзолата.
#
# примерен изход
# Вашата сметка е ... лв. След заклъглянето сумата е ... лв., т.е. оставяте на слушителя ... лв. бакшиш.

import math

HOT_Combo = 19.95
Tower_menu = 13.80
chicken_8_menu = 13.50

amount = HOT_Combo + Tower_menu + chicken_8_menu

# за да закръглим получената стойност, ще използваме метод от вградената библиотека math и по-точно -> math.ceil()
amount_ceiling = math.ceil(amount)
tip = amount_ceiling - amount

print(f"Вашата сметка е {amount} лв. След заклъглянето сумата е {amount_ceiling} лв., т.е. оставяте на слушителя {tip} лв. бакшиш.")