# Задача №4 - опитайте сами
# Направете програма, която при въведени име, презиме и фамилия извежда в конзолата следното съобщение:
# "{първата буква от името с голям шрифт}.{първата буква от презимето с голям шрифт}.{фамилията, започваща с главна буква, като всички останали букви от нея са малки}"
#
# примерен вход:
# вероНикА
# симеонОВА
# ЕВГЕНИЕВА

# примерен изход:
# В.С.Евгениева

first_name = input("Enter your first name:\t").upper()
middle_name = input("Enter your middle name:\t").upper()
last_name = input("Enter your last name:\t").capitalize() # метод, който конвертира стринга в желания формат

print(f"{first_name[0]}.{middle_name[0]}.{last_name}")

