# Условие 1: Напишете програма, която при подадено цяло число n,
# принтира всяко число i между 1 и n.

n = int(input("Моля, въведете число: "))

for i in range(1, n + 1):
    print(i)



# Условие 2: Същото, но принтирайки само четните числа между 1 и n.

for j in range(1, n + 1):
    if j % 2 == 0:
        print(j)



# Условие 3: Принтирайте числата между n и n^2, които се делят на 3.

for i in range(n, n * n + 1):
    if i % 3 == 0:
        print(i)



# Условие 4: Принтирайте сбора на числата между 1 и n^2.

sum = 0
for i in range(1, n * n + 1):
    sum += i

print(sum)